/* XTIT: Info Screen text when applying the NUIStyleSheet. */
"applyNUIStyleSheetApplyStepInfoScreenText" = "Defnyddio DalenArddullNUI.";

/* XTIT: Info Screen text when applying the SAP Mobile Services LogSettings. */
"applySAPcpmsLogSettingsStepInfoScreenText" = "Defnyddio GosodiadauLog SAP Mobile Services.";

/* XFLD: Text information if the provided credentials were invalid. */
"authenticationFailedMessage" = "Dilysu wedi methu!";

/* XTIT: Info Screen text before presenting the Basic Authentication view. */
"basicAuthenticationStepInfoScreenText" = "Wrthi'n dilysu manylion adnabod.";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the onboarding flow. */
"cancelAlertControllerTitleText" = "Ydych chi'n siŵr eich bod am ganslo'r broses cynefino?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the restore flow. */
"cancelRestoreAlertControllerTitleText" = "Ydych chi'n siŵr eich bod am ganslo'r broses adfer?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the reset passcode flow. */
"cancelResetPasscodeAlertControllerTitleText" = "Ydych chi'n siŵr eich bod am ganslo'r broses ailosod cod cyfrin?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the authentication process. */
"cancelAuthenticationProcessAlertControllerTitleText" = "Ydych chi'n siŵr eich bod am ganslo'r broses Dilysu?";

/* Title of Alert window when asking for confirmation about triggering the reset passcode flow. */
"resetPasscodeAlertControllerTitleText" = "Ydych chi'n siŵr eich bod am ailosod y cod cyfrin?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the passcode change flow. */
"cancelPasscodeChangeControllerTitleText" = "Ydych chi'n siŵr eich bod am ganslo proses newid y cod cyfrin?";

/* XTIT: Title of Alert window when asking for confirmation about reset the application. */
"cancelPasscodeControllerTitleText" = "Ydych chi'n siŵr eich bod am ailosod eich Rhaglen?";

/* XTIT: Info Screen text when running the Composite Steps. */
"compositeStepInfoScreenText" = "Camau Cyfansawdd.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services ClientResources. */
"downloadSAPcpmsClientResourcesStepInfoScreenText" = "Wrthi'n llwytho AdnoddauCleient SAP Mobile Services i lawr.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services Destinations. */
"downloadSAPcpmsDestinationsStepInfoScreenText" = "Wrthi'n llwytho Cyrchfannau SAP Mobile Services i lawr.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services Settings. */
"downloadSAPcpmsSettingsStepInfoScreenText" = "Wrthi'n llwytho Gosodiadau SAP Mobile Services i lawr.";

/* XBUT: Text of button on FUIFeedbackScreen when the Face ID got disabled by passcode policy. */
"fuiFeedbackDisableFaceIDButtonText" = "Bwrw ymlaen";

/* XBUT: Text of button on FUIFeedbackScreen when the Touch ID is disabled by the new passcode policy */
"fuiFeedbackDisableTouchIDButtonText" = "Bwrw ymlaen";

/* XBUT: Text of button on FUIFeedbackScreen when the Face ID is enabled by the new passcode policy */
"fuiFeedbackEnableFaceIDButtonText" = "Galluogi";

/* XBUT: Text of button on FUIFeedbackScreen when the Touch ID is enabled by the new passcode policy */
"fuiFeedbackEnableTouchIDButtonText" = "Galluogi";

/* XTIT: FUIFeedbackScreen headline description text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDDetailDescription" = "Defnyddiwch god cyfrin i fewngofnodi y tro nesaf.";

/* XTIT: FUIFeedbackScreen headline text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDHeadlineDescription" = "Fydd ID Wyneb ddim ar gael mwyach";

/* XTIT: FUIFeedbackScreen title text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDTitleText" = "Newidiadau Polisi";

/* XTIT: FUIFeedbackScreen headline description text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDDetailDescription" = "Defnyddiwch god cyfrin i fewngofnodi y tro nesaf.";

/* XTIT: FUIFeedbackScreen headline text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDHeadlineDescription" = "Fydd ID Cyffwrdd ddim ar gael mwyach";

/* XTIT: FUIFeedbackScreen title text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDTitleText" = "Newidiadau Polisi";

/* XTIT: FUIFeedbackScreen detail description text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenEnableFaceIDDetailDescription" = "Gallwch droi'r nodwedd hon ymlaen neu ei diffodd unrhyw bryd o dan Gosodiadau.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy changed and face ID is enabled. */
"fuiFeedbackScreenEnableFaceIDHeadlineDescription" = "Mae ID Wyneb ar gael nawr! Bydd galluogi ID Wyneb yn rhoi mynediad cyflymach i chi at eich gwybodaeth.";

/* XTIT: FUIFeedbackScreen title text when Face ID is enabled in the new passcode policy. */
"fuiFeedbackScreenEnableFaceIDTitleText" = "ID Wyneb";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenEnableTouchIDDetailDescription" = "Gallwch droi'r nodwedd hon ymlaen neu ei diffodd unrhyw bryd o dan Gosodiadau.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy changed and touch ID is enabled. */
"fuiFeedbackScreenEnableTouchIDHeadlineDescription" = "Mae ID Cyffwrdd ar gael nawr! Bydd galluogi ID Cyffwrdd yn rhoi mynediad cyflymach i chi at eich gwybodaeth.";

/* XTIT: FUIFeedbackScreen title text when touchID is enabled by the new passcode policy. */
"fuiFeedbackScreenEnableTouchIDTitleText" = "ID Cyffwrdd";

/* XBUT: Text of button on FUIFeedbackScreen when passcode change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedActionButtonText" = "Bwrw ymlaen";

/* XMSG: FUIFeedbackScreen description when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedDescriptionLabel" = "Ewch ati i greu cod cyfrin newydd.";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedHeadlineText" = "Mae polisi cod cyfrin wedi newid";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedTitleText" = "Newidiadau Polisi";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeAndFaceIDDetailDescription" = "O hyn ymlaen, ni fydd angen Cod Cyfrin ac ID Wyneb wrth fewngofnodi. \n\nByddwch yn ymuno â'r Ap yn uniongyrchol.";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeAndTouchIDDetailDescription" = "O hyn ymlaen, ni fydd angen Cod Cyfrin ac ID Cyffwrdd wrth fewngofnodi. \n\nByddwch yn ymuno â'r Ap yn uniongyrchol.";

/* XBUT: Text of button on FUIFeedbackScreen when the passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeButtonText" = "Iawn";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeDetailDescription" = "O hyn ymlaen, ni fydd angen Cod Cyfrin wrth fewngofnodi. \n\nByddwch yn ymuno â'r Ap yn uniongyrchol.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeHeadlineDescription" = "Mae polisi mewngofnodi wedi newid";

/* XTIT: FUIFeedbackScreen title text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeTitleText" = "Hysbysiad";

/* XBUT: Text of button on FUIFeedbackScreen after migration when passcode creation is mandatory. */
"migrationOnlyBiometricIDWasSetPreviouslyButtonText" = "Bwrw ymlaen";

/* XTIT: Description of FUIFeedbackScreen after migration when previously only biometricID was set. */
"migrationOnlyBiometricIDWasSetPreviouslyDescriptionText" = "Ar gyfer y fersiwn hon, mae'n rhaid cael cod cyfrin. Ewch ati i greu cod cyfrin ar gyfer y rhaglen.";

/* XTIT: Title of FUIFeedbackScreen after migration when previously only biometricID was set. */
"migrationOnlyBiometricIDWasSetPreviouslyHeadlineText" = "Mae cod cyfrin yn orfodol";

/* XBUT: Text of No button. */
"noButtonText" = "Na";

/* XTIT: Info Screen text before presenting the OAuth2 Authentication view. */
"oauth2AuthenticationStepInfoScreenText" = "Wrthi'n dilysu manylion adnabod OAuth 2.0.";

/* XTIT: Text of PasscodeInputController when user wants to enable face ID. */
"passcodeInputControllerEnableFaceIDText" = "I alluogi ID Wyneb, rhowch eich cod cyfrin:";

/* XTIT: Text of PasscodeInputController when user wants to enable touch ID. */
"passcodeInputControllerEnableTouchIDText" = "I alluogi ID Cyffwrdd, rhowch eich cod cyfrin:";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the onboarding flow. */
"rejectAlertControllerTitleText" = "Heb ganiatâd, fydd dim modd i chi fwrw ymlaen â'r broses cynefino.";

/* XBUT: Text of No button of reject. */
"rejectNoButtonText" = "Rhoi caniatâd";

/* XBUT: Text of Yes button of reject. */
"rejectYesButtonText" = "Gadael y broses";

/* XTIT: Info Screen text before presenting the SAML Authentication view. */
"samlAuthenticationStepInfoScreenText" = "Wrthi'n dilysu manylion adnabod SAML.";

/* XTIT: Info Screen text before presenting the SAP Mobile Services UserIdentity Discovery Authentication view. */
"sapcpmsUserIdentityDiscoveryAuthenticationStepInfoScreenText" = "Wrthi'n dilysu manylion adnabod Darganfod HunaniaethDefnyddiwr SAP Mobile Services.";

/* XTIT: Info Screen text before presenting the SLS Authentication view. */
"slsAuthenticationStepInfoScreenText" = "Wrthi'n dilysu manylion adnabod SLS.";

/* XMSG: Message for the user to fill all the fields for authentication. */
"slsFillAllOfTheFieldsErrorMessage" = "Llenwch bob maes.";

/* XBUT: Text of Yes button. */
"yesButtonText" = "Iawn";

/* XBUT: Text of Continue button. */
"continueButtonText" = "Bwrw ymlaen";

/* XBUT: Text of Cancel button. */
"cancelButtonText" = "Canslo";

/* XTIT: Title of Usage Collection Consent onboarding flow. */
"UsageCollectionConsentTitle" = "Casglu am Ddefnydd";

/* XTIT: Body of Usage Collection Consent onboarding flow. */
"UsageCollectionConsentBody" = "Mae gweinyddwr y rhaglen yn gofyn i chi roi caniatâd i gasglu data amdanoch chi gan ddefnyddio'r rhaglen er mwyn cael syniad ynghylch gwella'r ap. Mae casglu data yn cynnwys gwybodaeth am sut rydych chi'n defnyddio'r ap, fel amser sy'n cael ei dreulio yn defnyddio'r ap neu sut rydych chi'n symud o gwmpas yr ap.";

/* XTIT: Usage Collection Consent opt-out alert message. */
"usageOptOutAlertMessage" = "Ydych chi am optio allan?";

/* XTIT: Usage Collection Consent opt-in alert message. */
"usageOptInAlertMessage" = "Ydych chi am optio i mewn?";

/* XTIT: Title of Crash Report Collection Consent onboarding flow. */
"CrashReportCollectionConsentTitle" = "Casglu Adroddiadau am Broblemau";

/* XTIT: Body of Crash Report Collection Consent onboarding flow. */
"CrashReportCollectionConsentBody" = "Mae gweinyddwr y rhaglen yn gofyn i chi roi caniatâd i gasglu data i gael diagnosis a dadansoddi problemau gyda'r ap er mwyn gallu gwella sefydlogrwydd yr ap. Dim ond adroddiadau am broblemau a gwybodaeth am y ddyfais fydd yn cael ei gasglu.";

/* XTIT: Title of alert to be shown when QR Digital Signature Verification fails. */
"qrDigitalSignatureVerficationFailedTitle" = "Wedi methu!";

/* \"XMSG: Message telling that the QR Digital Signature Verification failed.\" */
"qrDigitalSignatureVerficationFailedMessage" = "Wedi methu Dilysu Llofnod Cod QR!";

/* \"XMSG: Message telling that the QR code signature verification succeeded.\" */
"qrDigitalSignatureVerficationSucceededMessage" = "Wedi dilysu llofnod digidol cod QR. Byddwch yn cael ei cysylltu â:";

/* \"XTIT: Title of InfoScreenPresenter when token expires and authentication fails.\" */
"authenticationErrorTitle" = "Gwall Dilysu";

/* \"XMSG: Message of InfoScreenPresenter when token expires and authentication fails.\" */
"authenticationErrorMessage" = "Doedd dim modd i ni eich dilysu. Mewngofnodwch.";

/* \"XBUT: Text of Error button.\" */
"errorButtonText" = "Gwall";

